# Список из чисел
nums=[5,10,1,60,25,3]
# Отображение содержимого списка:
print("Список из числен:", nums)
# Длина списка:
print("Длина списка:", len(nums))
# Первый список:
print("первый элемент:", nums[0]) # [0] список начинается всегда с 0 а не с 1
# Последний элемент:
print("последний элемент:", nums[-1]) # [-1] означает первый символ с конца списка
# Наибольшее значение:
print("Наибольшее значение:", max(nums))
# Наименьшее значение:
print("Наименьшее значение:", min(nums))
# Сумма:
print("Сумма:", sum(nums))
# Список в обратном порядке:
print("Список в обратном поряке:", list(reversed(nums)))
# Сортировка по возрастанию значений:
print("По возрастанию значений:", sorted(nums))
# Сортировка по убыванию значений
print("По убыванию значений:", sorted(nums, reverse=True))
# Исходный список
print("Исходный список:", nums)
# Изменение значеня элемента списка:
nums[1]="текст"
# Отображение содержимого списка
print("После внесения изменений:", nums)
# Замена части элементов текста
nums[1:-1]=["A","B"]
print("После змены элементов:", nums)
# Список чисел от 5 до 10:
nums=list(range(5,11))
print("Список чисел от 5 до 10:", nums)
# Удаление элементов из списка
nums[2:4]=[]
print("После удаления двух элементов:", nums)
del nums[len(nums)-1]
print("Удален последний элемент:", nums)
# Нечетные числа:
nums=[2*k+1 for k in range(5)]
print("Нечетные числа:", nums)
# Список из символов создается нна основе текста:
symbs=list("Python")
# Отображение содержимого списка:
print("Список из символов:", symbs)
# Два первых символа:
print("Два первых символа:", symbs[:2])
# Прочие символы:
print("Прочие символы:", symbs[2:])
