# Считываем количество слагаемых
n = input("Укажите количество слагаемых: ")
# Пременная с текстовым значением:
txt="1"
# Индексная переменная:
k=1
# Оператор цикла для формирования текста с выражением для суммы натуральных чисел:
while str(k)!=n:
    # Увеличение значения идексной переменной:
    k=k+1
    # Добавления фрагмента к тексту с выражением для суммы натуральных чисел:
    txt=txt+"+"+str(k)
#Отображение результата:
print(txt,"=", eval(txt))
