def sum_nums(a, b):
	sum = a + b
	return sum # теперь функция sum_nums возращает значение как результат работы

  
first_sum = sum_nums(10, 5) # присваиваем вызову функции переменную для сохранения значения
print(first_sum)

print(sum_nums(50.5, 20)) # можем не присваивать переменную, а сразу выводить результат в терминал

print(sum_nums(sum_nums(50.5, 20), 30)) 
# в данном случае мы несколько раз вызываем функцию: 
# 1) выполняет sum_nums(50.5, 20) 
# 2) выполняет sum_nums(<значение, получанное из sum_nums(50.5, 20)> значния 30)
# 3) выводит ответ